tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "minio/stable"
tap "superbrothers/zsh-kubectl-prompt"
brew "cmake"
brew "dprint"
brew "fzf"
brew "helm"
brew "just"
brew "kompose"
brew "kubernetes-cli"
brew "lsd"
brew "neovim"
brew "powerlevel10k"
brew "python@3.11"
brew "watch"
brew "zellij"
brew "fluxcd/tap/flux"
brew "minio/stable/mc"
cask "alacritty"
cask "font-jetbrains-mono"
vscode "github.vscode-github-actions"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "skellock.just"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
